<a href="https://colab.research.google.com/github/suyeon0702/database/blob/main/%EA%B9%80%EC%88%98%EC%97%B0_ch5_homework_2020_student.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

# Homework - SQL1

1. Use Google Colabortory and do your homework.
3. (In Google colaboratory) Before you submit your homework, restart kernel and run every cell!
4. Save (File->Save) the file
5. Submit your homework (this file) in Google classroom
6. **Don't forget to click "제출" button** ("Submit", "완료로 표시", 또는 "제출" 버턴을 누르지 않으면 제출된 것이 아님)
7. No late homeworks will be accepted for any reason!

To edit this cell, double click here

```
이름: 김수연
학번: 201800839
학과: 컴퓨터전자시스템공학부
제출일: 2020-11-20 금
```

- 권고사항: 모든 SQL select 문에 tuple variable를 사용할 것.

- SQL 작성시, 문제에 주어지지 않은 상수를 사용하는 경우 (cheating), **마이너스 점수**를 받는다.

- **점수: 1번은 20점 나머지는 10점**

아래는 학생과 수업에 관련된 데이터베이스 테이블이다. 

![image.png](attachment:image.png)

In [ ]:
%load_ext sql

In [ ]:
!pip install pymysql

Requirement already satisfied: pymysql in /usr/local/lib/python3.6/dist-packages (0.10.1)

### Use your host, id, and password

In [ ]:
import getpass
user = 'K'
password = getpass.getpass()
host='database-k.cmwfybsdxmni.us-east-1.rds.amazonaws.com'
database = ''
connection_string = f'mysql+pymysql://{user}:{password}@{host}:3306/{database}'
    
%sql $connection_string

··········

'Connected: K@'

### Create your univdb database and use it

In [ ]:
%%sql

DROP DATABASE IF EXISTS univdb;
CREATE DATABASE IF NOT EXISTS univdb;

 * mysql+pymysql://K:***@database-k.cmwfybsdxmni.us-east-1.rds.amazonaws.com:3306/
6 rows affected.
1 rows affected.

[]

In [ ]:
%sql USE univdb;

 * mysql+pymysql://K:***@database-k.cmwfybsdxmni.us-east-1.rds.amazonaws.com:3306/
0 rows affected.

[]

#### 1.  관계형 데이터베이스 테이블 스키마(create table)을 생성하고, MySQL DBMS를 이용하여 테이블을 생성하시오. 

- 테이블은 적절한 컬럼 데이터 타입, Primary Key, Foreign Key (on delete, on update rule 포함, restrict, set null, cascade), 필요하다면 Unique, NOT NULL 등이 표시되어야 한다. 

- 조건: 선수과목 정보는 course 정보 때문에 유지하는 정보이다. 즉, Course가 삭제되면, 불필요한 정보이다.
- 스키마 작성시 9번 문제가 성공할 수 있도록 스키마를 작성하여야 한다.

- Semester은 enum type을 사용하여, 봄, 여름, 가을, 겨울 순서가 되게 한다.
- Grade는 enum type을 사용하여 A, B, C, D, F 순서가 되게 한다.

In [ ]:
%%sql

DROP TABLE if exists GRADE_REPORT;
DROP TABLE if exists STUDENT;
DROP TABLE if exists PREREQUISITE;
DROP TABLE if exists SECTION;
DROP TABLE if exists COURSE;

 * mysql+pymysql://K:***@database-k.cmwfybsdxmni.us-east-1.rds.amazonaws.com:3306/
0 rows affected.
0 rows affected.
0 rows affected.
0 rows affected.
0 rows affected.

[]

In [ ]:
%%sql
-- YOUR CODE HERE 17

create table COURSE (
    Course_name char(30) not null,
    Course_number varchar(20) not null,
    Credit_hours INT,
    Department char(5),
    primary key (Course_number)
) engine = InnoDB;

create table SECTION (
    Section_identifier INTEGER not null,
    Course_number varchar(20) not null,
    Semester enum('Spring', 'Summer', 'Fall', 'Winter'),
    Year decimal(2, 0),
    Instructor char(15),
    primary key (Section_identifier),
    foreign key (Course_number) references COURSE(Course_number)
      on update cascade
) engine = InnoDB;

create table PREREQUISITE (
    Course_number char(20) not null,
    Prerequisite_number char(20) not null,
    primary key (Course_number, Prerequisite_number),
    foreign key (Course_number) references COURSE(Course_number)
      on delete cascade
) engine = InnoDB;

create table STUDENT (
    Name char(15) not null,
    Student_number integer not null,
    Class INT,
    Major char(5),
    primary key (Student_number)
) engine = InnoDB;

create table GRADE_REPORT (
    Student_number integer not null,
    Section_identifier INTEGER not null,
    Grade enum('A', 'B', 'C', 'D', 'F'),
    primary key (Student_number, Section_identifier),
    foreign key (Student_number) references STUDENT(Student_number) on update cascade,
    foreign key (Section_identifier) references SECTION(Section_identifier) on update cascade
) engine = InnoDB;

 * mysql+pymysql://K:***@database-k.cmwfybsdxmni.us-east-1.rds.amazonaws.com:3306/
0 rows affected.
0 rows affected.
0 rows affected.
0 rows affected.
0 rows affected.

[]

#### 2. 각 테이블에 위에 테이블에 주어진 행들을 “insert into”를 이용하여 행들을 삽입하시오. Select \* from <table_name>를 이용하여 삽입의 성공 여부를 확인하시오.

In [ ]:
%%sql
-- YOUR CODE HERE 10


insert into COURSE values('Intro to Computer Science', 'CS1310', 4, 'CS');
insert into COURSE values('Data Structures', 'CS3320', 4, 'CS');
insert into COURSE values('Discrete Mathematics', 'MATH2410', 3, 'MATH');
insert into COURSE values('Database', 'CS3380', 3, 'CS');

insert into SECTION values(85, 'MATH2410', 'Fall', 07, 'King');
insert into SECTION values(92, 'CS1310', 'Fall', 07, 'Anderson');
insert into SECTION values(102, 'CS3320', 'Spring', 08, 'Knuth');
insert into SECTION values(112, 'MATH2410', 'Fall', 08, 'Chang');
insert into SECTION values(119, 'CS1310', 'Fall', 08, 'Anderson');
insert into SECTION values(135, 'CS3380', 'Fall', 08, 'Stone');

insert into PREREQUISITE values('CS3380', 'CS3320');
insert into PREREQUISITE values('CS3380', 'MATH2410');
insert into PREREQUISITE values('CS3320', 'CS1310');


insert into STUDENT values('Smith', 17, 1, 'CS');
insert into STUDENT values('Brown', 8, 2, 'CS');


insert into GRADE_REPORT values(17, 112, 'B');
insert into GRADE_REPORT values(17, 119, 'C');
insert into GRADE_REPORT values(8, 85, 'A');
insert into GRADE_REPORT values(8, 92, 'A');
insert into GRADE_REPORT values(8, 102, 'B');
insert into GRADE_REPORT values(8, 135, 'A');

 * mysql+pymysql://K:***@database-k.cmwfybsdxmni.us-east-1.rds.amazonaws.com:3306/
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.

[]

### Run the following cell to show that insert is correctly done

In [ ]:
%sql select * from STUDENT;

 * mysql+pymysql://K:***@database-k.cmwfybsdxmni.us-east-1.rds.amazonaws.com:3306/
2 rows affected.

[('Brown', 8, 2, 'CS'), ('Smith', 17, 1, 'CS')]

In [ ]:
%sql select * from COURSE;

 * mysql+pymysql://K:***@database-k.cmwfybsdxmni.us-east-1.rds.amazonaws.com:3306/
4 rows affected.

[('Intro to Computer Science', 'CS1310', 4, 'CS'),
 ('Data Structures', 'CS3320', 4, 'CS'),
 ('Database', 'CS3380', 3, 'CS'),
 ('Discrete Mathematics', 'MATH2410', 3, 'MATH')]

In [ ]:
%sql select * from SECTION;

 * mysql+pymysql://K:***@database-k.cmwfybsdxmni.us-east-1.rds.amazonaws.com:3306/
6 rows affected.

[(85, 'MATH2410', 'Fall', Decimal('7'), 'King'),
 (92, 'CS1310', 'Fall', Decimal('7'), 'Anderson'),
 (102, 'CS3320', 'Spring', Decimal('8'), 'Knuth'),
 (112, 'MATH2410', 'Fall', Decimal('8'), 'Chang'),
 (119, 'CS1310', 'Fall', Decimal('8'), 'Anderson'),
 (135, 'CS3380', 'Fall', Decimal('8'), 'Stone')]

In [ ]:
%sql select * from GRADE_REPORT;

 * mysql+pymysql://K:***@database-k.cmwfybsdxmni.us-east-1.rds.amazonaws.com:3306/
6 rows affected.

[(8, 85, 'A'),
 (8, 92, 'A'),
 (8, 102, 'B'),
 (8, 135, 'A'),
 (17, 112, 'B'),
 (17, 119, 'C')]

In [ ]:
%sql select * from PREREQUISITE;

 * mysql+pymysql://K:***@database-k.cmwfybsdxmni.us-east-1.rds.amazonaws.com:3306/
3 rows affected.

[('CS3320', 'CS1310'), ('CS3380', 'CS3320'), ('CS3380', 'MATH2410')]

#### 3. Database 과목을 수강한 학생들의 이름을 나열하시오.

In [ ]:
%%sql
-- YOUR CODE HERE 10

select s.name
from STUDENT s, COURSE c, GRADE_REPORT g, SECTION t
where c.course_name = 'Database' and c.course_number = t.course_number and t.section_identifier = g.section_identifier and g.student_number = s.student_number

 * mysql+pymysql://K:***@database-k.cmwfybsdxmni.us-east-1.rds.amazonaws.com:3306/
1 rows affected.

[('Brown',)]

#### 4. Grade_report테이블에 <8, 112, NULL> 행을 삽입하시오. 동일한 과목(course)을 두 번 이상 수강한 학생의 이름을 찾으시오.

In [ ]:
%sql insert into GRADE_REPORT values (8, 112, NULL);

 * mysql+pymysql://K:***@database-k.cmwfybsdxmni.us-east-1.rds.amazonaws.com:3306/
1 rows affected.

[]

In [ ]:
%%sql
-- YOUR CODE HERE 10

select distinct s.name
from STUDENT s, GRADE_REPORT g, GRADE_REPORT r, SECTION t, SECTION n
where g.student_number = r.student_number and
      g.section_identifier = t.section_identifier and
      r.section_identifier = n.section_identifier and
      g.section_identifier != r.section_identifier and
      t.course_number = n.course_number and
      s.student_number = g.student_number

 * mysql+pymysql://K:***@database-k.cmwfybsdxmni.us-east-1.rds.amazonaws.com:3306/
1 rows affected.

[('Brown',)]

#### 5. Database 과목을 듣기 위해 (직접 또는 간접적으로: directly or indirectly) 미리 들어야 하는(prerequisite) 과목(Course_name)들을 모두 나열하시오. (Prerequisite는 Acyclic graph이고 path의 최대 길이는 3이라고 가정함. 길이 3: A-B-C-D)

In [ ]:
%%sql
-- YOUR CODE HERE 10
(
    select o.course_name
    from COURSE c, COURSE o, PREREQUISITE p
    where c.course_name = 'Database' and 
          c.course_number = p.course_number and
          p.prerequisite_number = o.course_number
)
UNION
(
    select o.course_name
    from COURSE c, COURSE o, PREREQUISITE p, PREREQUISITE q
    where c.course_name = 'Database' and
          c.course_number = p.course_number and
          p.prerequisite_number = q.course_number and
          q.prerequisite_number = o.course_number
)
UNION
(
    select o.course_name
    from COURSE c, COURSE o, PREREQUISITE p, PREREQUISITE q, PREREQUISITE u
    where c.course_name = 'Database' and
          c.course_number = p.course_number and
          p.prerequisite_number = q.course_number and
          q.prerequisite_number = u.course_number and
          u.prerequisite_number = o.course_number
)

 * mysql+pymysql://K:***@database-k.cmwfybsdxmni.us-east-1.rds.amazonaws.com:3306/
3 rows affected.

[('Data Structures',),
 ('Discrete Mathematics',),
 ('Intro to Computer Science',)]

#### 6. 전공으로 수강한 과목들만 나열하는 MAJOR_GRADE_REPORT테이블을 만드시오. 테이블을 생성하고, GRADE_REPORT 테이블에서 전공으로 수강한 경우에 해당하는 행들만 아래 테이블에 삽입하시오. 전공으로 수강하였다는 것은 학생의 전공(Major)과 COURSE의 개설 Department가 같으면 전공으로 수강한 과목이다.
   
    MAJOR_GRADE_REPORT(Student_number, Section_identifier, Grade)

In [ ]:
%%sql
-- YOUR CODE HERE 10
create table MAJOR_GRADE_REPORT (
    Student_number integer not null,
    Section_identifier INTEGER not null,
    Grade enum('A', 'B', 'C', 'D', 'F'),
    primary key (Student_number, Section_identifier),
    foreign key (Student_number) references STUDENT(Student_number) on update cascade,
    foreign key (Section_identifier) references SECTION(Section_identifier) on update cascade
) engine = InnoDB;

insert into MAJOR_GRADE_REPORT(Student_number, Section_identifier, Grade)
select g.student_number, g.section_identifier, g.grade
from STUDENT s, COURSE c, SECTION t, GRADE_REPORT g
where g.student_number = s.student_number and
      g.section_identifier = t.section_identifier and
      t.course_number = c.course_number and
      s.major = c.department

 * mysql+pymysql://K:***@database-k.cmwfybsdxmni.us-east-1.rds.amazonaws.com:3306/
0 rows affected.
4 rows affected.

[]

### Run the following cell to show that insert is correctly done

In [ ]:
%sql select * from MAJOR_GRADE_REPORT;

 * mysql+pymysql://K:***@database-k.cmwfybsdxmni.us-east-1.rds.amazonaws.com:3306/
4 rows affected.

[(8, 92, 'A'), (8, 102, 'B'), (8, 135, 'A'), (17, 119, 'C')]

#### 7. 모든 학생들의 성적들을 다음과 같이 출력하려 한다. 적절한 SQL문을 작성하여 실행하시오. 
- 결과 테이블은 Major, Student_number, Year, Semester, Course_number 순서로 정렬되어야 한다.
- 결과 테이블 애트리뷰트 이름 및 순서: (Major, Student_number, Student_name, Year, Semester, Course_number, Course_name, Grade)

In [ ]:
%%sql
-- YOUR CODE HERE 10

select s.major, s.student_number, s.name, t.year, t.semester, t.course_number, c.course_name, g.grade
from STUDENT s, COURSE c, SECTION t, GRADE_REPORT g
where s.student_number = g.student_number and
      g.section_identifier = t.section_identifier and
      t.course_number = c.course_number
order by s.major, s.student_number, t.year, t.semester, t.course_number

 * mysql+pymysql://K:***@database-k.cmwfybsdxmni.us-east-1.rds.amazonaws.com:3306/
7 rows affected.

[('CS', 8, 'Brown', Decimal('7'), 'Fall', 'CS1310', 'Intro to Computer Science', 'A'),
 ('CS', 8, 'Brown', Decimal('7'), 'Fall', 'MATH2410', 'Discrete Mathematics', 'A'),
 ('CS', 8, 'Brown', Decimal('8'), 'Spring', 'CS3320', 'Data Structures', 'B'),
 ('CS', 8, 'Brown', Decimal('8'), 'Fall', 'CS3380', 'Database', 'A'),
 ('CS', 8, 'Brown', Decimal('8'), 'Fall', 'MATH2410', 'Discrete Mathematics', None),
 ('CS', 17, 'Smith', Decimal('8'), 'Fall', 'CS1310', 'Intro to Computer Science', 'C'),
 ('CS', 17, 'Smith', Decimal('8'), 'Fall', 'MATH2410', 'Discrete Mathematics', 'B')]

#### 8. Brown이 수강한 Database 과목의 학점을 F로 수정하시오.

In [ ]:
%%sql
-- YOUR CODE HERE 10

update GRADE_REPORT
set grade = 'F'
where student_number in (
    select s.student_number
    from STUDENT s
    where s.name = 'Brown'
    )
  and section_identifier in (
      select t.section_identifier
      from SECTION t, COURSE c
      where t.course_number = c.course_number and
            c.course_name = 'Database'
  )

 * mysql+pymysql://K:***@database-k.cmwfybsdxmni.us-east-1.rds.amazonaws.com:3306/
1 rows affected.

[]

### Run the following cell to show that update is correctly done

In [ ]:
%sql select * from GRADE_REPORT where Student_number = 8 and Section_identifier = 135;

 * mysql+pymysql://K:***@database-k.cmwfybsdxmni.us-east-1.rds.amazonaws.com:3306/
1 rows affected.

[(8, 135, 'F')]

#### 9. Brown의 학번을 8번에서 9번으로 수정하시오. 반드시 update문 하나만 있어야 하며, update 문은 반드시 성공하여야 한다. 테이블의 Foreign Key 선언문을 삭제하면 안됨.

In [ ]:
%%sql
-- YOUR CODE HERE 10

update STUDENT
set student_number = 9
where name = 'Brown'

 * mysql+pymysql://K:***@database-k.cmwfybsdxmni.us-east-1.rds.amazonaws.com:3306/
1 rows affected.

[]

### Run the following cell to show that update is correctly done

In [ ]:
%sql select * from STUDENT where name = 'Brown';

 * mysql+pymysql://K:***@database-k.cmwfybsdxmni.us-east-1.rds.amazonaws.com:3306/
1 rows affected.

[('Brown', 9, 2, 'CS')]